app/controllers/users_controller.rb

INSERT INTO `users` (`name`, `created_at`, `updated_at`, `bio`) VALUES('Jebus', '2010-04-19 17:34:23', '2010-04-19 17:34:23', 'I make water into wine. Also like fish.')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT * FROM `users` WHERE (`users`.`id` = 2)
UPDATE `users` SET `bio` = 'I command huge comments of ice. I also like fried rice. Just kidding, Like ham', `updated_at` = '2010-04-19 17:57:44' WHERE `id` = 2
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])